Revit 2024 API
BuiltInFailures.SiteImportFailures.DifferentEntityTypes Property
 Can't auto-detect boundary. The layers selected contain data that may make the Toposurface look incorrect. For better results, try selecting only those layers that contain relevant 3D info.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DifferentEntityTypes { get; }
Visual Basic
Public Shared ReadOnly Property DifferentEntityTypes As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DifferentEntityTypes {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteImportFailures Class
Autodesk.Revit.DB Namespace